---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallDesignThickness
source: html/473d2758-32b3-da0a-c361-955dc177fd87.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallDesignThickness Property

Represents wall design thickness of rectangle.

## Syntax (C#)
```csharp
public double WallDesignThickness { get; set; }
```

## Remarks
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
 In EN standard it is marked as "d". //Need to be verified!!!!!!!
 In ACI standard it is marked as "d". //Need to be verified!!!!!!!